#include"IR.h"
#include "iodefine.h"
#include <machine.h>

#define AD_0	S12AD.ADDR0	     // CN3-9 : AN0(0～4069)
#define AD_1	S12AD.ADDR1	     // CN3-10: AN1(0～4069)
#define AD_2	S12AD.ADDR2	     // CN3-11 :AN2(0～4069)
#define AD_3	S12AD.ADDR3	     // CN3-12 :AN3(0～4069)
#define AD_4	S12AD.ADDR4	     // AN4(0～4069)

int S[4] = {0};	//IRセンサー値

/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
/* 関 数 概 要：A/D値の更新                                                                         */
/* 関 数 詳 細：S12AD.ADANS.WORD で設定されたポートをAD変換する                                     */
/* 引       数：なし										    */
/* 戻  り   値：なし										    */
/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
void AD_update(void)
{	
	S12AD.ADCSR.BIT.ADST = 1;  	// A/D変換開始
   	while(S12AD.ADCSR.BIT.ADST == 0); // 測定が終了するまで待つ
}

/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
/* 関 数 概 要：赤外線LED出力												  			            */
/* 関 数 詳 細：												                                   */
/* 引       数： 	3:LED4 2:LED3 1:LED2 0:LED1													    */
/* 戻  り   値：なし										    									*/
/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */ 
void ir(char n){
	
	if((n & 0x01) > 0)PORTD.DR.BIT.B0 = 0;
	else PORTD.DR.BIT.B0 = 1;
	
	if((n & 0x02) > 0)PORTD.DR.BIT.B1 = 0;
	else PORTD.DR.BIT.B1 = 1;
	
	if((n & 0x04) > 0)PORTD.DR.BIT.B2 = 0;
	else PORTD.DR.BIT.B2 = 1;
	
	if((n & 0x08) > 0)PORTD.DR.BIT.B3 = 0;
	else PORTD.DR.BIT.B3 = 1;
}


/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
/* 関 数 概 要：赤外線センサー値更新										  			            */
/* 関 数 詳 細：												                                   */
/* 引       数： なし																			    */
/* 戻  り   値：なし										    									*/
/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */ 
void ir_update(){
	
	static int num = 0;
	static int s[4] = {0,0,0,0};
	
	AD_update();
	
	//マスの中央でセンサーが52になるように微調整
	switch(num){
		case 0:	//FL R
			s[0] = AD_1;
			s[2] = AD_3;
			
			num = 1;
			break;
		
		case 1://OFF
			S[0] = -(s[0] - AD_1) * 77 /100;//なぜマイナスになるか不明 センサーのばらつきを微調整（本当は自動でやりたい）
			S[2] = -(s[2] - AD_3) * 70 /100;
			
			num = 2;
			break;
			
		case 2://L FR
			s[1] = AD_2;
			s[3] = AD_0;
	
			num = 3;
			break;
		case 3://OFF
			S[1] = -(s[1] - AD_2 );// * 13 /10;
			S[3] = -(s[3] - AD_0 ) * 83 /100;
			
			num = 0;
			break;
	}
	
	switch(num){
		case 0:	//FL R
			ir(5);// 0101
			break;
			
		case 1://OFF
			ir(0);// 0000
			break;
			
		case 2://L FR
			ir(10);//1010
			break;
		
		case 3://OFF
			ir(0);// 0000
			break;
	}
}

/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
/* 関 数 概 要：赤外線センサー値取得										  			            */
/* 関 数 詳 細：												                                   */
/* 引       数： なし																			    */
/* 戻  り   値：なし										    									*/
/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */ 
int get_IR(int num){
	return max(0,S[num]);//マイナス値は０にする	
	//return S[num];
}